app/Controllers/Login.php

    public function logar()
    {
        $EMAIL = $this->request->getPost('EMAIL');
        $SENHA = $this->request->getPost('SENHA');

        if ($this->UsuarioModel->where(['EMAIL' => $EMAIL, 'SENHA' => $SENHA])->first())
        {
            $usuario = $this->UsuarioModel->where(['EMAIL' => $EMAIL, 'SENHA' => $SENHA])->findAll()[0];
---
SELECT *
FROM `USUARIOS`
WHERE `EMAIL` = 'felipeofragoso@gmail.com'
AND `SENHA` = 'Tapadao2000'
 LIMIT 1
SELECT *
FROM `USUARIOS`
WHERE `EMAIL` = 'felipeofragoso@gmail.com'
AND `SENHA` = 'Tapadao2000'